#include<stdio.h> //เอาไว้ใช้เรียกไลบรารี่ ซึ่งก็เหมือนมีคำสั่งพิเศษข้างใน อันนี้คือเอาไว้รับค่าเข้าตัวแปร แล้วก็ปริ้นท์ค่า ปล. ไม่ใช่studioนะ
#include<string.h> //อันนี้เอาไว้หาความยาว string แล้วก็ดูตัวพิมพ์เล็กพิมพ์ใหญ่ด้วย
#include<math.h> //เอาไว้ใช้คำนวนบางอย่าง เช่น log ยกกำลัง หาค่าpi
#include<bits/stdc++.h> //มีทุกอย่างบนจักรวาล แต่อย่าพึ่งใช้มันเลย


int main(){ //อันนี้เป็นฟังก์ชันหลัก ก็คือโปรแกรมมันจะรันในนี้แหละ
    //ตัวแปร
    //อย่าลืม ; (semicolon) แต่ละบรรทัดนะ
    int x=5;//ตัวแปรเก็บค่าจำนวนเต็ม ตั้งแต่ -2^31 ถึง 2^31-1 ซึ่งตัวแปร ถ้าไม่กำหนดค่าให้มัน ระบบจะกำหนดค่ามั่วๆให้มัน อย่างเช่น x ถ้าเราไม่กำหนดให้มันมันจะได้ค่าอะไรไม่รู้ แต่พอเรากำหนดแล้วมันก็จะเป็น 5
    long long y; //ตัวแปรเก็บค่าจำนวนเต็ม ตั้งแต่ -2^63 ถึง 2^63-1
    unsigned int z; //ตัวแปรเก็บค่าจำนวนเต็มตั้งแต่ 2^32-1 unsigned long long ก็จะเป็น 2^64-1
    int a[10]; /*ใส่วงเล็บก้ามปูเรียกว่าอาเรย์ เป็นการจองพื้นที่ในแรมให้ติดกัน คือแรมอะ มันจะมีลักษณะเป็นแบบ เหมือนช่องๆๆ ที่แต่ละช่องมีเลข 1กับ0แทนbit ช่ะ
         int มันก็จะจอง 32 bit ใช่ปะ  ส่วน int a[10]อะ มันก็จะ จอง 32 บิต 10ช่องที่ติดๆกัน โดยเริ่มจาก ช่องที่0 เวลาจะเรียกเรียกว่าa[0] ถึง ช่องที่ 9 ก็คือa[9]
        ซึ่งทำให้สะดวกเวลาเราเรียกตำแหน่ง ทำโจทย์ไปเดี๋ยวก็เข้าใจเองแหละ tip: ถ้าต้องการอาเรย์ขนาด 10 ควรประกาศเกินไว้ 3-5ตัว
                    แล้วเวลาเรียก เรียกจาก a[1] ถึง a[10] ไม่ต้องใช้ a[0]

    */
    char c='a',d=65,e='\0',s[10];/*อีกหนึ่งอย่างที่ควรรู้คือ การปะกาษ datatype(ชนิดตัวแปล) นำหน้านั้น หลังประกาศแต่ละตัวแล้วสามารถใส่ลูกน้ำอะ มันจะเป็นการประกาศตัวแปรชนิดเดียวกันไปเรื่อยๆ จนกว่าจะเจอ ;
                         ต่อมา ตัวแปรนี้เรียก characte เอาไว้เก็บตัวอักษร ในระบบเลข ascii ในส่วนของตัว c คือกำหนดตัวอักษรจากตัวอักษรจริงๆเลย โดยต้องใส่ ' ' ครอบไว้เสมอ
                        ส่วน d คือ กำหนดค่าจากตาราง ascii เช่น 'A' คือตัวที่ 65 เพราะฉนั้น d=65 มีความหมายว่า d='A' ส่วน ตัวที่มี \ ตามด้วยอะไรข้างหลัง เช่น \0 เป็นอัขระพิเศษที่มีความหมาย
                        เช่น \n คือการเว้นบรรทัด \t \0 คือจบstring เดี๋ยวจะเข้าใจเองว่ามันคือไร ต่อมา สมบัติที่สำคัญของ char ได้แก่ เอาไปบวกลบกันได้ เช่น สามารถคำนวน c-dได้
                        แล้วก็ sอะ สัญลักษณ์มันเหมือนอาเรย์ใข่มั้ย ใช่ มันคืออาเรย์ที่ประกอบด้วยตัวอักษร เรียกว่า string เช่นคำว่าhello ก็ประกอบจากหลายตัวอักษรใช่มั้ยละ เราเลยใช้string ยังไงล่ะ
                        ซึ่งตอนจบstring ควรจบด้วย \0 หรืออัขระพิเศษของเรานั่นเอง เพราะไม่งั้นเวลาเราไล่สตริงอะ มันก็จะวิ่งตามstringไปเรื่อยๆ แล้วพอจบที่มีตัวนส.ที่เราต้องการแล้วอะ อาเรย์อะ มันก็คือตัวแปร ถ้าเราสร้างแล้วไม่ประกาศอะไร มันก็จะมีค่ามั่วๆ
                        ทีนี้แหละ มันก็จะวิ่งต่อไปเรื่อยๆได้ เราเลยต้องมี \0 ไว้เพื่อให้รู้ว่านี่จบstringแล้วนะ
    */
    bool de //ตัวแปรตั้งชื่อด้วยอัขระเกิน 1 ตัวได้นะ แต่ก็มีคำต้องห้าม และคำที่ไม่ควรใช้  คำที่เป็น สีน้ำเงินอะ เป็นคำต้องห้าม ส่วนสีเขียว ไม่ควรใช้ แล้วก็อันนี้คือค่าความจริง มีได้ 2 ค่าคือ true / false โดย true =1 false =0
    //จบพาร์ทตัวแปลและ
    //operation
    x=x+5,y=y*3;// เป็นการกำหนดให้ ตัวแปรฝั่งซ้าย มีค่าเท่ากับค่าฝั่งขวา

}
